In [1]:
import numpy as np
import pandas as pd

In [2]:
s1 = pd.Series(np.arange(5))
s2 = pd.Series(np.arange(4))

In [3]:
print(s1)
print(s2)

0    0
1    1
2    2
3    3
4    4
dtype: int64
0    0
1    1
2    2
3    3
dtype: int64

In [4]:
s3 = s1 + s2
print(s3)

0    0.0
1    2.0
2    4.0
3    6.0
4    NaN
dtype: float64

In [10]:
df1 = pd.DataFrame(np.arange(6).reshape(2,3),
    columns = list('ABC'),
    index = ['Tim', 'Tom']
)
df1

     A  B  C
Tim  0  1  2
Tom  3  4  5

In [12]:
df2 = pd.DataFrame(np.arange(9).reshape(3,3),
    columns = list('ABC'),
    index = ['Tim', 'Kate', 'Tom']
)
df2

      A  B  C
Tim   0  1  2
Kate  3  4  5
Tom   6  7  8

In [13]:
df1 + df2

        A     B     C
Kate  NaN   NaN   NaN
Tim   0.0   2.0   4.0
Tom   9.0  11.0  13.0

In [14]:
df1.add(df2, fill_value=0)

        A     B     C
Kate  3.0   4.0   5.0
Tim   0.0   2.0   4.0
Tom   9.0  11.0  13.0

In [16]:
df1

     A  B  C
Tim  0  1  2
Tom  3  4  5

In [21]:
s = df1.iloc[0]
s

A    0
B    1
C    2
Name: Tim, dtype: int64

In [25]:
df1 - s
# df1

     A  B  C
Tim  0 -2 -4
Tom  3  1 -1

In [26]:
data = pd.DataFrame(
    np.arange(9).reshape(3,3),
    columns = list('ACD'),
    index = ['Tim', 'Kate', 'Tom']
)
data

      A  C  D
Tim   0  1  2
Kate  3  4  5
Tom   6  7  8

In [30]:
s = data.iloc[1]
s

A    3
C    4
D    5
Name: Kate, dtype: int64

In [31]:
data - s

      A  C  D
Tim  -3 -3 -3
Kate  0  0  0
Tom   3  3  3

In [32]:
data

      A  C  D
Tim   0  1  2
Kate  3  4  5
Tom   6  7  8

In [34]:
s2 = data['A']
s2

Tim     0
Kate    3
Tom     6
Name: A, dtype: int64

In [36]:
data.sub(s2, axis = 'index')

      A  C  D
Tim   0  1  2
Kate  0  1  2
Tom   0  1  2

### Applying a function

In [37]:
df = pd.DataFrame(
    np.random.randn(4,3),
    index = ["Kim", "Susan", "Tim", "Tom"],
    columns = list('ABC')
)
df

              A         B         C
Kim    0.354313 -0.146274  0.818830
Susan -0.490627  0.868618 -1.009101
Tim    0.353925  0.568641 -1.672559
Tom   -0.407227 -0.304485  1.109991

In [38]:
np.abs(df)

              A         B         C
Kim    0.354313  0.146274  0.818830
Susan  0.490627  0.868618  1.009101
Tim    0.353925  0.568641  1.672559
Tom    0.407227  0.304485  1.109991

In [39]:
0.641672 - 0.062436

0.579236

In [40]:
f = lambda x : x.max() - x.min()

In [41]:
df.apply(lambda x: x.max() - x.min())

A    0.844940
B    1.173103
C    2.782551
dtype: float64

In [42]:
df.apply(lambda x: x.max() - x.min(), axis = 1)

Kim      0.965104
Susan    1.877719
Tim      2.241200
Tom      1.517218
dtype: float64

In [43]:
def f(x):
    return x**2

In [44]:
df.apply(f)

              A         B         C
Kim    0.125537  0.021396  0.670482
Susan  0.240715  0.754497  1.018285
Tim    0.125263  0.323353  2.797454
Tom    0.165834  0.092711  1.232081